tap "homebrew/cask"
tap "aws/tap"
tap "hashicorp/tap"
tap "weaveworks/tap"
cask_args appdir: "/Applications"

brew "awscli"
brew "aws-sam-cli"
brew "velero"
brew "eksctl"
brew "grep", link: true
brew "helm"
brew "jq"
brew "kubectl", link: true
brew "mas"
brew "mysql-client", link: true
brew "packer"
brew "tcptraceroute"
brew "tfenv"
brew "tree"
brew "zplug"
brew "neovim"

cask "1password"
cask "alfred"
cask "appcleaner"
cask "bettertouchtool"
cask "docker"
cask "firefox"
cask "intellij-idea"
cask "iterm2"
cask "karabiner-elements"
cask "keyboardcleantool"
cask "mysqlworkbench"
cask "visual-studio-code"
cask "clickup"
cask "google-cloud-sdk"

#mas "BetterSnapTool", id: 417375580
mas "Slack", id: 803453959
mas "The Unarchiver", id: 425424353

